FOAMySeesExampleCases/CantileverBeam/noGroundMotion/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "./precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{

  Interface1
  {
    mesh              Fluid-Mesh;
    locations         faceCenters;
    connectivity      false;
    patches           (interface);
	   readData
   (
      Displacement
    );
    writeData
    (
      Force
    );
  };

//  Interface2
//  {
//    mesh              Fluid-Mesh-Nodes;
//    locations         faceNodes;
//    connectivity      false;
//    patches           (interface);
//   readData
//   (
//
//    );
//	    writeData
//    (
//
//    );
//  };
  
};


FSI
{
 namePointDisplacement pointDisplacement;
 nameT p_rgh;
 nameP p;
// solverType incompressible;
// nu              nu [ 0 2 -1 0 0 0 0 ] 1e-03;
//rho             rho [1 -3 0 0 0 0 0] 1000;
}

 // Interface1
 // {
 //   mesh              Fluid-Mesh;
 //   patches           (CFT1 CFT2 CFT3 CFT4 breakawaySlab);
 //   locations         faceCenters;
 //   
 //   readData
 //   (
 //     Displacement
 //   );
 //   
 //   writeData
 //   (
 //     Force
 //   );
 // };